# Tap Homebrew
tap "anchore/grype"
tap "civo/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


##############################################################################
# optional or environment-specific applications
##############################################################################
# for macOS
# cask_args appdir: "/Applications"

## for personal use
brew "speedtest-cli"
brew "youtube-dl"

# personal use
cask "authy"
cask "bitwarden"
cask "firefox"
cask "gimp"
cask "handbrake"
cask "inkscape"
cask "obs"
cask "rectangle"
cask "spotify"
cask "transmission"
cask "vlc"
cask "vnc-viewer"
cask "wireshark"

# System
brew "binutils"
brew "coreutils"
brew "curl"
brew "dnstracer"
brew "findutils"
brew "gawk"
brew "gmp"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "htop"
brew "moreutils"
brew "nmap"
brew "openssh"
brew "openssl"
brew "pidof"
brew "pstree"
brew "rename"
brew "rlwrap"
brew "rsync"
brew "screen"
brew "socat"
brew "ssh-copy-id"
brew "sslscan"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Ops
brew "ansible"
brew "awscli"
brew "civo"
brew "docker-compose"
brew "google-cloud-sdk"
brew "grype"
brew "hcloud"
brew "jsonnet"
brew "jsonnet-bundler"
brew "kind"
brew "lima"
brew "podman"
brew "tfenv"

# Images, Audio, Video
brew "ffmpeg"
brew "gifify"
brew "gifsicle"
brew "imagemagick"

# Archive & Git
brew "git"
brew "git-lfs"
brew "hub"
brew "p7zip"
brew "tig"
brew "xz"

# JSON
brew "jo"
brew "jq"

# Dev
cask "java"
cask "visual-studio-code"
brew "asdf"
brew "boost"
brew "cmake"
brew "go"
brew "node"
brew "openjdk"
brew "postgresql"
brew "pyenv"
brew "python"
brew "rbenv"
brew "ruby"
brew "rust"
brew "yarn"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "openshift-cli"
brew "helm"
brew "minikube"

# GitLab Pages
brew "hugo"
